## Sumit Patel - 40
### Experiment 12

In [31]:
import pandas as pd

### Data Frame

In [32]:
data = {
    'Name': ['Arthur', 'Ted', 'lara', 'Matthew', 'Eva'],
    'Age': [24, 27, 22, 32, 29],
    'City': ['Canada', 'Houston', 'Chicago', 'Houston', 'Miami'],
    'Salary': [50000, 70000, 40000, 67000, 85000]
}
df = pd.DataFrame(data)

print("Original DataFrame:\n")
print(df)

Original DataFrame:

      Name  Age     City  Salary
0   Arthur   24   Canada   50000
1      Ted   27  Houston   70000
2     lara   22  Chicago   40000
3  Matthew   32  Houston   67000
4      Eva   29    Miami   85000

In [33]:
print("\nSummary Statistics:\n")
print(df.describe().round(2))

Summary Statistics:

         Age   Salary
count   5.00      5.0
mean   26.80  62400.0
std     3.96  17643.7
min    22.00  40000.0
25%    24.00  50000.0
50%    27.00  67000.0
75%    29.00  70000.0
max    32.00  85000.0

### Add new Column "Bonus"

In [34]:
df['Bonus'] = df['Salary'] * 0.20
print("\nDataFrame after Adding Bonus Column:\n")
print(df)

DataFrame after Adding Bonus Column:

      Name  Age     City  Salary    Bonus
0   Arthur   24   Canada   50000  10000.0
1      Ted   27  Houston   70000  14000.0
2     lara   22  Chicago   40000   8000.0
3  Matthew   32  Houston   67000  13400.0
4      Eva   29    Miami   85000  17000.0

### Filtering rows (salary > 60,000)

In [35]:
filtered_df = df[df['Salary'] > 60000]
print("\nFiltered DataFrame (Salary > 60,000):\n")
print(filtered_df)

Filtered DataFrame (Salary > 60,000):

      Name  Age     City  Salary    Bonus
1      Ted   27  Houston   70000  14000.0
3  Matthew   32  Houston   67000  13400.0
4      Eva   29    Miami   85000  17000.0

### Sort By Age

In [36]:
sorted_df = df.sort_values(by='Age', ascending=True)
print("\nDataFrame Sorted by Age:\n")
print(sorted_df)

DataFrame Sorted by Age:

      Name  Age     City  Salary    Bonus
2     lara   22  Chicago   40000   8000.0
0   Arthur   24   Canada   50000  10000.0
1      Ted   27  Houston   70000  14000.0
4      Eva   29    Miami   85000  17000.0
3  Matthew   32  Houston   67000  13400.0